[
{"thread": [{"text": "SHARE your destiny in the COMMENTS! What's the 1 dream you can't stop thinking about?", "username": "edmylett"}, {"text": "Simplicity is the key to spectacular results. The biggest bonus is that when you get spectacular results, you also get spectacular emotions.", "username": "edmylett"}, {"text": "To live your best life, EMBRACE GROWTH. Growth is uncomfortable. But if you want to be better than you are today, accept that uncomfortable changes are part of the process.", "username": "edmylett"}, {"text": "The old saying that laughter is CONTAGIOUS is absolutely true!", "username": "edmylett"}, {"text": "You were born WORTHY. Don’t let other people’s opinions of you convince you otherwise. Go out and crush it today. 🔥", "username": "edmylett"}, {"text": "Have you devoted the right amount of EFFORT to the THOUGHTS and ACTIONS of what you want in life and the steps you’ll need to get there?", "username": "edmylett"}, {"text": "You will never be “ready“ to start a new BUSINESS, to try a new CHALLENGE, to START or LEAVE a RELATIONSHIP.\n\nDrop the idea that you have to be perfectly ready.", "username": "edmylett"}, {"text": "When you’re not moving forward, you’re not GROWING.\n\nAnd if you’re not growing, you’re DYING!", "username": "edmylett"}, {"text": "Parenting is the most incredibly SATISFYING thing you’ll ever do. But it is also one of the MOST DIFFICULT!\n\nLEAD by example.", "username": "edmylett"}, {"text": "Invest in KINDNESS often and watch how RICH you become!", "username": "edmylett"}, {"text": "WINNING is SPECIAL... but you know what’s better than winning?!?!\n\nWINNING with your FRIENDS.\n\nWINNING with FRIENDS is 1,000,000 times BETTER", "username": "edmylett"}, {"text": "WINNING is SPECIAL... but you know what’s better than winning?!?!\n\nWINNING with your FRIENDS.\n\nWINNING with FRIENDS is 1,000,000 times BETTER", "username": "edmylett"}, {"text": "Luck is when preparation meets opportunity. If you aren't hustling NOW to stay prepared, don't cry later when \"luck\" passes you by!", "username": "edmylett"}, {"text": "Open yourself to incredible possibilities as you develop a MINDSET that helps you create the best life you’ve always imagined for yourself.", "username": "edmylett"}, {"text": "Give yourself permission to DREAM ONE MORE DREAM.", "username": "edmylett"}, {"text": "Although a small part of your destiny is beyond your control, you have COMPLETE CONTROL over the biggest parts of what’s to come. The script gets to be written by you and God You get to decide!", "username": "edmylett"}, {"text": "Just because you love someone, doesn’t give them the right to mistreat you YOU TEACH PEOPLE how to TREAT YOU\n\n You are WORTHY to have HAPPINESS AND SUCCESS. No matter what you've been through in life you can FLIP THE SCRIPT. Drop a\n\n in COMMENTS if you agree", "username": "edmylett"}, {"text": "Sometimes we can't explain our INTUITION. We just need to TRUST and have FAITH You only have TWO jobs when these thoughts and feelings speak to your soul… LISTEN & ACT You’ll know what to do next.", "username": "edmylett"}, {"text": "THOUGHTS become THINGS When you write down your ideas, thoughts, plans, and goals, your SUBCONSCIOUS MIND can go hard to work morphing those raw thoughts into new and incredible solutions. Get into the HABIT. WRITE IT DOWN.", "username": "edmylett"}, {"text": "Your MESS does NOT DISQUALIFY you from winning!!! Your MESS that MAKES you WIN!", "username": "edmylett"}, {"text": "You'll never know how HIGH you can jump, how FAR you can go, or what you can ACCOMPLISH unless you put everything you've got into your EFFORTS. Don't hold back! What's the biggest challenge you're facing now? Are you up for it?", "username": "edmylett"}, {"text": "YOU CANNOT BECOME WEALTHY IF YOU DON’T SAVE MONEY! You have to FIND A WAY to pay yourself first in any way you can. I DON’T CARE IF ITS $10/M SPENDER and SAVERS Which one do you want to be?", "username": "edmylett"}, {"text": "In the storm of my most difficult moments… You know the moments when everything seems to be falling down around you? GRATITUDE. It is the REMEDY. What are you most grateful for today?", "username": "edmylett"}, {"text": "The world is already full of rejection. Surround yourself with people who root for you even when the rest of the world says you're crazy!", "username": "edmylett"}, {"text": "EVERY person has SUPERPOWERS. You may not even know what your superpowers are... until you’re challenged & they reveal themselves.", "username": "edmylett"}]}
]